using satellites.Data.Models;

namespace satellites.Data
{
    public class DBObjects
    {
        public static void inital(AppDbContent content)
        {
            if (!content.Planet.Any())
            {
                content.Planet.AddRange(Planets.Select(c => c.Value));
            }

            if (!content.Satelite.Any())
            {
                content.AddRange(
                    new Satellites
                    {
                        satellite_name="Місяць",
                        discovery_date= "1900-01-01",
                        diameter =3471.94,
                        turnover_period =365,
                        atmosphere =false,
                        notes = "Місяць — єдиний природний супутник планети Земля.",
                        longnote = "Місяць — єдиний природний супутник планети Земля. Другий за яскравістю об'єкт на земному небосхилі після Сонця і п'ятий за величиною супутник планет Сонячної системи. Станом на 1 травня 2020 року перший і єдиний позаземний об'єкт природного походження, на якому побувала людина. Середня відстань між центрами Землі і Місяця — 384 400 км.",
                        img = "/img/місяць.jpg",
                        planet_id = Planets["Земля"]
                    },
                    new Satellites
                    {
                        satellite_name = "Європа",
                        discovery_date = "1610-01-07",
                        diameter = 3138,
                        turnover_period = 3.5,
                        atmosphere = true,
                        notes = "Європа — найменший з чотирьох галілеєвих супутників.",
                        longnote = "Європа , або Юпітер II — супутник Юпітера, найменший з чотирьох галілеєвих супутників. Відкрита 1610 року Галілео Галілеєм і, можливо, незалежно від нього Симоном Маріусом. Протягом століть за Європою велися все більш різнобічні спостереження з допомогою телескопів, а починаючи із 1970-х років — і космічних апаратів, які пролітали поблизу.",
                        img = "/img/європа.jpg",
                        planet_id = Planets["Юпітер"]
                    },
                    new Satellites
                    {
                        satellite_name = "Ганімед",
                        discovery_date = "1610-01-07",
                        diameter = 5268.2,
                        turnover_period = 1,
                        atmosphere = true,
                        notes = "Ганімед — найбільший супутник Юпітера.",
                        longnote = "Ганімед — найбільший супутник Юпітера, що належить до групи галілеєвих супутників. Одночасно є найбільшим супутником у Сонячній системі. Його діаметр дорівнює 5268 км, що на 2 % більше, ніж у Титана (другого за величиною супутника в Сонячній системі) і на 8 % більше, ніж у Меркурія. При цьому маса Ганімеда становить лише 45 % маси Меркурія, але серед супутників планет вона є рекордною. Ганімед перевищує Місяць за масою в 2,02 разів[1][2]. Облітаючи орбіту приблизно за сім днів, Ганімед бере участь в орбітальному резонансі 1:2:4 з двома іншими супутниками Юпітера — Європою та Іо.",
                        img = "/img/юпітер.jpg",
                        planet_id = Planets["Юпітер"]
                    },
                    new Satellites
                    {
                        satellite_name = "Іо",
                        discovery_date = "1610-01-08",
                        diameter = 3643.2,
                        turnover_period = 1.75,
                        atmosphere = false,
                        notes = "Іо — супутник Юпітера, найближчий до планети з чотирьох галілеєвих супутників.",
                        longnote = "Іо — супутник Юпітера, найближчий до планети з чотирьох галілеєвих супутників. Його діаметр становить 3642 кілометри, тому Іо є четвертим за величиною супутником у Сонячній системі. Названий на честь міфологічної Іо, яка була жрицею Гери та коханкою Зевса. Має особливо бурхливу вулканічну активність. Його відкрив Галілео Галілей у 1610 році за допомогою найпершого в історії телескопа. Перші фото Іо були зроблені зондом «Піонер-11», який пролетів повз Юпітер в грудні 1974.",
                        img = "/img/іо.jpg",
                        planet_id = Planets["Юпітер"]
                    },
                    new Satellites
                    {
                        satellite_name = "Титан",
                        discovery_date = "1655-03-25",
                        diameter = 5149.4,
                        turnover_period = 16,
                        atmosphere = true,
                        notes = "Титан — найбільший за розміром супутник Сатурна",
                        longnote = "Титан — крупнейший спутник Сатурна, второй по величине спутник в Солнечной системе (после спутника Юпитера Ганимеда), является единственным, кроме Земли, телом в Солнечной системе, для которого доказано стабильное существование жидкости на поверхности, и единственным спутником планеты, обладающим плотной атмосферой.",
                        img = "/img/титан.jpg",
                        planet_id = Planets["Сатурн"]
                    },
                    new Satellites
                    {
                        satellite_name = "Каллісто",
                        discovery_date = "1610-01-07",
                        diameter = 4820.6,
                        turnover_period = 17,
                        atmosphere = true,
                        notes = "Каллісто — другий за розміром супутник Юпітера.",
                        longnote = "Каллісто (лат. Callisto;) — другий за розміром супутник Юпітера, один із чотирьох галілеєвих супутників і найдальший від планети серед них. Відкритий 1610 року Галілео Галілеєм, названий на честь персонажа давньогрецької міфології — Каллісто, коханки Зевса.",
                        img = "/img/місяць.jpg",
                        planet_id = Planets["Юпітер"]
                    },
                    new Satellites
                    {
                        satellite_name = "Тритон",
                        discovery_date = "1846-10-10",
                        diameter = 2706.8,
                        turnover_period = 5.9,
                        atmosphere = true,
                        notes = "Тритон — найбільший серед супутників Нептуна.",
                        longnote = "Тритон — найбільший серед супутників Нептуна. Обертання синхронне (постійно обернений до Нептуна одним боком). Передній бік (за рухом супутника) приблизно на 25 % темніший решти його поверхні. Має азотну атмосферу. Температура на поверхні Тритона становить лише 34,5 K (–235 °C) — там так само холодно, як на Плутоні. Настільки низька температура зумовлена зокрема високим альбедо (70—80 %). За такої температури метан, азот і двоокис вуглецю заморожені до твердого стану.",
                        img = "/img/тритон.jpg",
                        planet_id = Planets["Нептун"]
                    },
                    new Satellites
                    {
                        satellite_name = "Фобос",
                        discovery_date = "1877-08-18",
                        diameter = 22534,
                        turnover_period = 0.3,
                        atmosphere = false,
                        notes = "Фобос — один з двох супутників Марса.",
                        longnote = "Фобос — один з двох супутників Марса. Фобос обертається на середній відстані 2,77 радіуса Марса від центра планети (9400 км), що у 40 разів менше, ніж відстань від Землі до Місяця. Перицентр становить 9235,6 км, апоцентр — 9518,8 км. Він робить один оберт за 7 год 39 хв 14 с, що у три рази швидше обертання Марса навколо власної осі. В результаті, на марсіанському небі Фобос сходить на заході і заходить на сході.\r\n\r\nФобос обертається навколо своєї осі з тим же періодом, що й навколо Марса, тому завжди повернутий до планети одним і тим самим боком. Його орбіта розташовується всередині межі Роша для «рідкого» супутника, однак припливні сили не розривають супутник, оскільки він має рихлу структуру і його орбіта наразі лежить поза межею Роша для «твердого» супутника. Однак через таке розташування орбіти неможливо створити штучний супутник Фобоса.",
                        img = "/img/фобос.jpg",
                        planet_id = Planets["Марс"]
                    },
                    new Satellites
                    {
                        satellite_name = "Енцелад",
                        discovery_date = "1789-08-28",
                        diameter = 504.2,
                        turnover_period = 0.3,
                        atmosphere = true,
                        notes = "Енцелад — чотирнадцятий за віддаленістю від планети супутник Сатурна.",
                        longnote = "Енцелад (Сатурн II; лат. Enceladus) — чотирнадцятий за віддаленістю від планети супутник Сатурна. Відкритий Вільямом Гершелем 28 серпня 1789 року. Діаметр — 500 км, радіус орбіти — 238 тис. км. Супутник є найсвітлішим небесним тілом Сонячної системи. Енцелад — найбільш геологічно активний супутник Сатурна. На ньому можуть бути водяні вулкани (гейзери), які оновлюють іній на поверхні та слугують джерелом речовини для розрідженого пилового кільця вздовж орбіти супутника. Проте енергетичне джерело цієї вулканічної та геологічної активності невідоме.",
                        img = "/img/місяць.jpg",
                        planet_id = Planets["Сатурн"]
                    },
                    new Satellites
                    {
                        satellite_name = "Харон",
                        discovery_date = "1789-08-28",
                        diameter = 1012,
                        turnover_period = 6.4,
                        atmosphere = false,
                        notes = "Харон — найбільший із 5 відомих супутників карликової планети Плутона.",
                        longnote = "Харон — найбільший із п'яти відомих супутників карликової планети Плутона, відомий також під назвою «Плутон I». Гравітаційний вплив Харона на Плутон настільки великий, що барицентр системи Плутон — Харон лежить поза Плутоном. Через це його інколи вважають компонентом подвійної планетної системи Плутон — Харон.",
                        img = "/img/харон.jpg",
                        planet_id = Planets["Плутон"]
                    }
                    );
            }
            content.SaveChanges();
        }

        private static Dictionary<string, Planets> planet;
        public static Dictionary<string, Planets> Planets
        {
            get
            {
                if (planet == null)
                {
                    var list = new Planets[]
                    {
                        new Planets {
                            planet_name = "Земля",
                            img="/img/земля.jpg",
                            note="Земля — третя від Сонця планета Сонячної системи, єдина планета, на якій відоме життя, домівка людства. Земля належить до планет земної групи і є найбільшою з цих планет у Сонячній системі. Землю іноді називають світом, латинською назвою Терра або грецькою — Гея. Земля є об'єктом дослідження значної кількості наук про Землю. Вивчення Землі як небесного тіла належить до царини астрономії, будову і склад Землі вивчає геологія, стан атмосфери — метеорологія, сукупність проявів життя на планеті — біологія. Географія дає опис особливостей рельєфу поверхні планети — океанів, морів, озер і річок, материків та островів, гір і долин, а також людські поселення та суспільні утворення: міста і села, держави, економічні райони тощо."
                        },
                        new Planets
                        {
                            planet_name="Юпітер",
                            img = "/img/юпітер.jpg",
                            note ="Юпі́тер — п'ята від Сонця та найбільша планета Сонячної системи. Відстань Юпітера від Сонця змінюється в межах від 4,95 до 5,45 а. о. (740—814 млн км), середня відстань 5,203 а. о. (778 млн км). Разом із Сатурном, Ураном і Нептуном Юпітер класифікують як газового гіганта."
                        },
                        new Planets
                        {
                            planet_name="Сатурн",
                            img = "/img/сатурн.jpg",
                            note ="Сатурн — шоста за віддаленістю від Сонця та друга за розмірами планета Сонячної системи. Сатурн швидко обертається навколо своєї осі (з періодом — 10,23 години), складається переважно з рідкого водню і гелію, має товстий шар атмосфери. Навколо Сонця Сатурн обертається за 29,46 земних років на середній відстані 1427 млн км. Екваторіальний діаметр верхньої межі хмар — 120 536 км, а полярний — на кілька сотень кілометрів менший. В атмосфері Сатурна міститься 94 % водню і 6 % гелію (за об'ємом). Його маса у 95 разів більша за масу Землі, магнітне поле трохи слабше за земне."
                        },
                        new Planets
                        {
                            planet_name="Нептун",
                            img = "/img/нептун.jpg",
                            note ="Нептун — планета Сонячної системи, восьма за віддаленістю від Сонця. Вона четверта за розміром у Сонячній системі, третя за масою і належить до планет-гігантів. Її орбіта перетинається з орбітою Плутона в деяких місцях. Також орбіту Нептуна перетинає комета Галлея. Маса Нептуна у 17,2 рази, а діаметр екватора у 3,9 рази більший за земний. Планета названа на честь римського бога морів."
                        },
                        new Planets
                        {
                            planet_name="Марс",
                            img = "/img/марс.jpg",
                            note ="Марс — четверта планета Сонячної системи за відстанню від Сонця та сьома за розміром і масою. Названа на честь Марса — давньоримського бога війни. Іноді Марс називають «червоною планетою» через червонуватий колір поверхні."
                        },
                        new Planets
                        {
                            planet_name="Плутон",
                            img = "/img/плутон.jpg",
                            note ="Плутон — найвідоміша мала планета Сонячної системи та найбільший транснептуновий об'єкт, перший відкритий об'єкт поясу Койпера. Дев'яте за розміром та десяте за масою небесне тіло, яке обертається навколо Сонця. Як і більшість тіл у поясі Койпера, Плутон складається здебільшого з каменю й льоду і є відносно малим."
                        },
                    };
                    planet = new Dictionary<string, Planets>();
                    foreach (Planets el in list)
                    {
                        planet.Add(el.planet_name, el);
                    }
                }
                return planet;
            }
        }
    }
}
